In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame(np.random.randn(10, 4),columns=list('ABCD'))

In [9]:
df.C.sort_values(ascending = False).tail(3)

0   -0.063557
2   -0.490687
6   -0.751694
Name: C, dtype: float64

In [10]:
df.describe()

               A          B          C          D
count  10.000000  10.000000  10.000000  10.000000
mean    0.421166  -0.275178   0.367325  -0.241534
std     0.704977   0.834532   0.712020   1.316089
min    -0.812072  -1.517589  -0.751694  -1.804006
25%     0.091871  -1.023369  -0.022357  -1.513291
50%     0.334270  -0.007336   0.316984  -0.134704
75%     0.733289   0.348947   0.989947   0.669373
max     1.648292   0.626798   1.399132   1.936260

In [11]:
df = pd.DataFrame({'A':['1','2','3','4']})

In [16]:
df.A.apply(lambda x:int(x)).sum()

10

In [18]:
#pd.DataFrame({'A':1,'B':8})报错

In [19]:
df = pd.DataFrame({'A':['1','2','3','4']})

In [20]:
df.reindex(['a','b','c','d'])

     A
a  NaN
b  NaN
c  NaN
d  NaN

In [28]:
data = pd.DataFrame({'订单号':[1,1,2,2,3,4,5],
                     '数量':[1,3,4,5,3,2,5],
                     '商品名称':['汉堡','可乐','热狗','汉堡','冰淇淋','掉渣饼','全家桶'],
                     '单价':['￥5','￥2','￥3','￥5','￥3','￥7','￥10']})

In [30]:
data['单价'] = data['单价'].apply(lambda x:int(x[1:]))

In [31]:
data

   订单号  数量 商品名称  单价
0    1   1   汉堡   5
1    1   3   可乐   2
2    2   4   热狗   3
3    2   5   汉堡   5
4    3   3  冰淇淋   3
5    4   2  掉渣饼   7
6    5   5  全家桶  10

In [44]:
data[data.商品名称.isin(data.groupby('商品名称').sum().数量.sort_values(ascending = False).head(1).index)].单价

0    5
3    5
Name: 单价, dtype: int64

In [47]:
data.groupby('订单号').sum().单价.sort_values(ascending = False).head(1)

订单号
5    10
Name: 单价, dtype: int64

In [48]:
data.数量.sum()

23

In [50]:
data.商品名称.nunique()

6

In [51]:
df.shape

(4, 1)

In [53]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 1 columns):
A    4 non-null object
dtypes: object(1)
memory usage: 112.0+ bytes

In [54]:
df = pd.DataFrame({"A":np.arange(1,5),
"B":np.arange(1,5),
"C":np.arange(1,5),
"D":np.arange(1,5),
"E":np.arange(1,5),})

In [55]:
df

   A  B  C  D  E
0  1  1  1  1  1
1  2  2  2  2  2
2  3  3  3  3  3
3  4  4  4  4  4

In [57]:
df.iloc[:,[0,2,4]]

   A  C  E
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [59]:
df.loc[:,('A','C','E')]

   A  C  E
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [60]:
df.iloc[:,::2]

   A  C  E
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [61]:
df.loc[:,::2]

   A  C  E
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4

In [64]:
df = pd.DataFrame({"A":np.arange(1,5),
"B":np.arange(2,6),
"C":np.arange(5,9),
"D":np.arange(1,5),
"E":np.arange(6,10)})

In [65]:
df

   A  B  C  D  E
0  1  2  5  1  6
1  2  3  6  2  7
2  3  4  7  3  8
3  4  5  8  4  9

In [66]:
df.sort_values(['B','E'],ascending = False)

   A  B  C  D  E
3  4  5  8  4  9
2  3  4  7  3  8
1  2  3  6  2  7
0  1  2  5  1  6

In [69]:
df.B.apply(lambda x :0 if x == 5 else x)

0    2
1    3
2    4
3    0
Name: B, dtype: int64

In [73]:
df.B.apply(lambda x:x if x!= 5 else x == 0)

0        2
1        3
2        4
3    False
Name: B, dtype: object

In [74]:
df

   A  B  C  D  E
0  1  2  5  1  6
1  2  3  6  2  7
2  3  4  7  3  8
3  4  5  8  4  9

In [76]:
df.iloc[:,:-3]

   A  B
0  1  2
1  2  3
2  3  4
3  4  5

In [77]:
df[df.columns[:-3]]

   A  B
0  1  2
1  2  3
2  3  4
3  4  5

In [78]:
df = pd.DataFrame({'one':np.random.randint(10,20,5),
                  'two':'too',
                  'three':np.arange(15,20)})

In [80]:
df[df.one>15]

   one  two  three
1   18  too     16
2   17  too     17
4   17  too     19

In [84]:
df = pd.DataFrame({ 'A' : 1.,
                      'C':pd.Series(1,index=list(range(1,5)),dtype='float32'),
                     'D' : np.array([3] *4,dtype='int32'),
                     'E':pd.Categorical(["test","train","test","train"]),
                   'F' : 'foo' })
df

     A    C  D      E    F
1  1.0  1.0  3   test  foo
2  1.0  1.0  3  train  foo
3  1.0  1.0  3   test  foo
4  1.0  1.0  3  train  foo

In [82]:
df.loc[3]

A       1
C       1
D       3
E    test
F     foo
Name: 3, dtype: object

In [83]:
df.iloc[:,1]

1    1.0
2    1.0
3    1.0
4    1.0
Name: C, dtype: float32

In [85]:
df = pd.DataFrame({'A':2.,
                 'B':5.,
                 'C':pd.Series(np.arange(0,5),index = list('abcde')),
                  'D':'too'})

In [86]:
df

     A    B  C    D
a  2.0  5.0  0  too
b  2.0  5.0  1  too
c  2.0  5.0  2  too
d  2.0  5.0  3  too
e  2.0  5.0  4  too

In [87]:
df.loc[['a','c','e'],['A','C','D']]

     A  C    D
a  2.0  0  too
c  2.0  2  too
e  2.0  4  too

In [90]:
df.iloc[[0,2,4],[0,2,3]]

     A  C    D
a  2.0  0  too
c  2.0  2  too
e  2.0  4  too

In [93]:
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv',sep = '\t')
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [94]:
raw_data = {'order_id':[1,1,1,1,2,2,2,3,3,3,3],
'quantity':[1,1,1,2,2,3,2,1,2,1,2],
'item_name':['lzze','Salsa','Chicken','Tomato','Fresh','lzze','Chicken','lzze','Fresh','Tomato','Salsa'],'choice_description':[np.nan,'apple',np.nan,'Beans','Drinks','Cola','Sprite',np.nan,'Cola','Sprite','Drinks'],
'item_price':['$2.39','$3.39','$3.39','$2.39','$6.98','$4.69','$4.39','$5.39','$7.39','$6.39','$3.39']}

In [99]:
df = pd.DataFrame(raw_data)
df

    order_id  quantity item_name choice_description item_price
0          1         1      lzze                NaN      $2.39
1          1         1     Salsa              apple      $3.39
2          1         1   Chicken                NaN      $3.39
3          1         2    Tomato              Beans      $2.39
4          2         2     Fresh             Drinks      $6.98
5          2         3      lzze               Cola      $4.69
6          2         2   Chicken             Sprite      $4.39
7          3         1      lzze                NaN      $5.39
8          3         2     Fresh               Cola      $7.39
9          3         1    Tomato             Sprite      $6.39
10         3         2     Salsa             Drinks      $3.39

In [100]:
df[(df.quantity == 1) & (df.item_name == 'Salsa')]

   order_id  quantity item_name choice_description item_price
1         1         1     Salsa              apple      $3.39

In [101]:
raw_data = {'order_id':[1,1,1,1,2,2,2,3,3,3,3],
'quantity':[1,1,1,2,2,3,2,1,2,1,2],
'item_name':['lzze','Salsa','Chicken','Tomato','Fresh','lzze','Chicken','lzze','Fresh','Tomato','Salsa'],'choice_description':[np.nan,'apple',np.nan,'Beans','Drinks','Cola','Sprite',np.nan,'Cola','Sprite','Drinks'],
'item_price':['$2.39','$3.39','$3.39','$2.39','$6.98','$4.69','$4.39','$5.39','$7.39','$6.39','$3.39']}

In [102]:
df = pd.DataFrame(raw_data)
df

    order_id  quantity item_name choice_description item_price
0          1         1      lzze                NaN      $2.39
1          1         1     Salsa              apple      $3.39
2          1         1   Chicken                NaN      $3.39
3          1         2    Tomato              Beans      $2.39
4          2         2     Fresh             Drinks      $6.98
5          2         3      lzze               Cola      $4.69
6          2         2   Chicken             Sprite      $4.39
7          3         1      lzze                NaN      $5.39
8          3         2     Fresh               Cola      $7.39
9          3         1    Tomato             Sprite      $6.39
10         3         2     Salsa             Drinks      $3.39

In [103]:
df[df.item_price>'$4']

   order_id  quantity item_name choice_description item_price
4         2         2     Fresh             Drinks      $6.98
5         2         3      lzze               Cola      $4.69
6         2         2   Chicken             Sprite      $4.39
7         3         1      lzze                NaN      $5.39
8         3         2     Fresh               Cola      $7.39
9         3         1    Tomato             Sprite      $6.39

In [104]:
price_num = [float(i[1:]) for i in df.item_price]

In [105]:
price_num

[2.39, 3.39, 3.39, 2.39, 6.98, 4.69, 4.39, 5.39, 7.39, 6.39, 3.39]

In [106]:
df['price'] = price_num

In [107]:
df

    order_id  quantity item_name choice_description item_price  price
0          1         1      lzze                NaN      $2.39   2.39
1          1         1     Salsa              apple      $3.39   3.39
2          1         1   Chicken                NaN      $3.39   3.39
3          1         2    Tomato              Beans      $2.39   2.39
4          2         2     Fresh             Drinks      $6.98   6.98
5          2         3      lzze               Cola      $4.69   4.69
6          2         2   Chicken             Sprite      $4.39   4.39
7          3         1      lzze                NaN      $5.39   5.39
8          3         2     Fresh               Cola      $7.39   7.39
9          3         1    Tomato             Sprite      $6.39   6.39
10         3         2     Salsa             Drinks      $3.39   3.39

In [111]:
df[df.price>4]

   order_id  quantity item_name choice_description item_price  price
4         2         2     Fresh             Drinks      $6.98   6.98
5         2         3      lzze               Cola      $4.69   4.69
6         2         2   Chicken             Sprite      $4.39   4.39
7         3         1      lzze                NaN      $5.39   5.39
8         3         2     Fresh               Cola      $7.39   7.39
9         3         1    Tomato             Sprite      $6.39   6.39

In [115]:
a={'name':['张三','李四','王五'],
'class':['A1','A2','A3'],
'age':[15,15,15]}
df=pd.DataFrame(a)
df

  name class  age
0   张三    A1   15
1   李四    A2   15
2   王五    A3   15

In [116]:
for x ,y in df.groupby('name'):
    print(x)

张三
李四
王五

In [117]:
df = pd.DataFrame({'A':[3,4,5,6],'B':['a','b','c','d'],'C':[11,33,99,33]})

In [118]:
df

   A  B   C
0  3  a  11
1  4  b  33
2  5  c  99
3  6  d  33

In [120]:
df.groupby(['C']).count()

    A  B
C
11  1  1
33  2  2
99  1  1

In [122]:
#type(df.groupby(['C']).count())

In [123]:
df.groupby('C').size()

C
11    1
33    2
99    1
dtype: int64

In [124]:
df.groupby('C').sum()

     A
C
11   3
33  10
99   5

In [129]:
df = pd.DataFrame({'A':['foo','bar','foo','bar','foo','bar','foo','foo'],
                   'B':['one','one','two','three','two','two','one','three'],
                   'C':np.random.randn(8),
                   'D':np.random.randn(8)})

In [130]:
df.groupby('B').max().C.sort_values(ascending = True
                                   )

B
three   -0.083244
one      0.235022
two      1.703773
Name: C, dtype: float64

In [131]:
df.groupby('B').C.max()

B
one      0.235022
three   -0.083244
two      1.703773
Name: C, dtype: float64

In [132]:
df=pd.DataFrame({'Year':['1960','1961','1962','1963','1964'],
'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],
'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42],
'Murder':[9,8,8,8,9],'Forcible_Rape':[17,17,17,17,21],
'Robbery':[10,10,11,11,13]})

In [133]:
df

   Year  Population  Total  Violent  Property  Murder  Forcible_Rape  Robbery
0  1960         179     33       28        30       9             17       10
1  1961         182     34       28        31       8             17       10
2  1962         185     37       30        34       8             17       11
3  1963         188     41       31        37       8             17       11
4  1964         191     45       36        42       9             21       13

In [135]:
df.Year = pd.to_datetime(df.Year,format = '%Y')

In [136]:
df

,Year,Population,Total,Violent,Property,Murder,Forcible_Rape,Robbery
0,1960-01-01,179,33,28,30,9,17,10
1,1961-01-01,182,34,28,31,8,17,10
2,1962-01-01,185,37,30,34,8,17,11
3,1963-01-01,188,41,31,37,8,17,11
4,1964-01-01,191,45,36,42,9,21,13

In [137]:
df=pd.DataFrame({'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]},index = pd.date_range('1960',periods=5,freq='AS'))

In [138]:
df

            Population  Total  Violent  Property
1960-01-01         179     33       28        30
1961-01-01         182     34       28        31
1962-01-01         185     37       30        34
1963-01-01         188     41       31        37
1964-01-01         191     45       36        42

In [141]:
df.index.name = 'Year'

In [142]:
df

            Population  Total  Violent  Property
Year
1960-01-01         179     33       28        30
1961-01-01         182     34       28        31
1962-01-01         185     37       30        34
1963-01-01         188     41       31        37
1964-01-01         191     45       36        42

In [2]:
df=pd.DataFrame({'Year':['1960','1961','1962','1963','1964'],
'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],
'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]})

In [3]:
df

   Year  Population  Total  Violent  Property
0  1960         179     33       28        30
1  1961         182     34       28        31
2  1962         185     37       30        34
3  1963         188     41       31        37
4  1964         191     45       36        42

In [4]:
df.set_index('Year',drop = True)

      Population  Total  Violent  Property
Year
1960         179     33       28        30
1961         182     34       28        31
1962         185     37       30        34
1963         188     41       31        37
1964         191     45       36        42

In [5]:
df=pd.DataFrame({'Population':[179,182,185,188,191],'Total':[33,34,37,41,45],'Violent':[28,28,30,31,36],'Property':[30,31,34,37,42]},index = pd.date_range('1960',periods=5,freq='AS'))

In [6]:
df

            Population  Total  Violent  Property
1960-01-01         179     33       28        30
1961-01-01         182     34       28        31
1962-01-01         185     37       30        34
1963-01-01         188     41       31        37
1964-01-01         191     45       36        42

In [8]:
df.resample('10AS').sum()

            Population  Total  Violent  Property
1960-01-01         925    190      153       174
1970-01-01           0      0        0         0

In [11]:
df.Population.resample('10AS').max()

1960-01-01    191.0
1970-01-01      NaN
Name: Population, dtype: float64

In [13]:
timerange = pd.date_range('2019-1-1','2019-2-1',freq='12H')

In [14]:
timerange

DatetimeIndex(['2019-01-01 00:00:00', '2019-01-01 12:00:00',
               '2019-01-02 00:00:00', '2019-01-02 12:00:00',
               '2019-01-03 00:00:00', '2019-01-03 12:00:00',
               '2019-01-04 00:00:00', '2019-01-04 12:00:00',
               '2019-01-05 00:00:00', '2019-01-05 12:00:00',
               '2019-01-06 00:00:00', '2019-01-06 12:00:00',
               '2019-01-07 00:00:00', '2019-01-07 12:00:00',
               '2019-01-08 00:00:00', '2019-01-08 12:00:00',
               '2019-01-09 00:00:00', '2019-01-09 12:00:00',
               '2019-01-10 00:00:00', '2019-01-10 12:00:00',
               '2019-01-11 00:00:00', '2019-01-11 12:00:00',
               '2019-01-12 00:00:00', '2019-01-12 12:00:00',
               '2019-01-13 00:00:00', '2019-01-13 12:00:00',
               '2019-01-14 00:00:00', '2019-01-14 12:00:00',
               '2019-01-15 00:00:00', '2019-01-15 12:00:00',
               '2019-01-16 00:00:00', '2019-01-16 12:00:00',
               '2019-01-17 00:00:00', '2019-01-17 12:00:00',
               '2019-01-18 00:00:00', '2019-01-18 12:00:00',
               '2019-01-19 00:00:00', '2019-01-19 12:00:00',
               '2019-01-20 00:00:00', '2019-01-20 12:00:00',
               '2019-01-21 00:00:00', '2019-01-21 12:00:00',
               '2019-01-22 00:00:00', '2019-01-22 12:00:00',
               '2019-01-23 00:00:00', '2019-01-23 12:00:00',
               '2019-01-24 00:00:00', '2019-01-24 12:00:00',
               '2019-01-25 00:00:00', '2019-01-25 12:00:00',
               '2019-01-26 00:00:00', '2019-01-26 12:00:00',
               '2019-01-27 00:00:00', '2019-01-27 12:00:00',
               '2019-01-28 00:00:00', '2019-01-28 12:00:00',
               '2019-01-29 00:00:00', '2019-01-29 12:00:00',
               '2019-01-30 00:00:00', '2019-01-30 12:00:00',
               '2019-01-31 00:00:00', '2019-01-31 12:00:00',
               '2019-02-01 00:00:00'],
              dtype='datetime64[ns]', freq='12H')

In [16]:
df=pd.DataFrame({'school':['GP','GP','GP','GP'],'sex':['F','F','M','F'],
'age':[18,17,15,16],'guardian':['mother','father','father','mother']})

In [17]:
df

  school sex  age guardian
0     GP   F   18   mother
1     GP   F   17   father
2     GP   M   15   father
3     GP   F   16   mother

In [18]:
df.guardian.str.upper()

0    MOTHER
1    FATHER
2    FATHER
3    MOTHER
Name: guardian, dtype: object

In [19]:
df.guardian.apply(lambda x:x.upper())

0    MOTHER
1    FATHER
2    FATHER
3    MOTHER
Name: guardian, dtype: object

In [22]:
def ages(x):
    if x>=17:
        return True
    else:
        return False

In [23]:
df.legal_drinker = df.age.apply(ages)

In [30]:
ages = df.age>=17

In [31]:
ages.values

array([ True,  True, False, False])

In [32]:
df.legal_drinker = ages.values

In [33]:
df

  school sex  age guardian
0     GP   F   18   mother
1     GP   F   17   father
2     GP   M   15   father
3     GP   F   16   mother

In [36]:
df['legal_drinker']=df['age'].apply(lambda x: True if x>=17 else False)

In [37]:
df

  school sex  age guardian  legal_drinker
0     GP   F   18   mother           True
1     GP   F   17   father           True
2     GP   M   15   father          False
3     GP   F   16   mother          False

In [40]:
df=pd.DataFrame({'age':[17,15,14,18,17],'Medu':[4,3,2,5,4],'sex':['F','F','M','M','M']})

In [41]:
df

   age  Medu sex
0   17     4   F
1   15     3   F
2   14     2   M
3   18     5   M
4   17     4   M

In [43]:
df.apply(lambda x:x+2 if type(x) is int else x)

   age  Medu sex
0   17     4   F
1   15     3   F
2   14     2   M
3   18     5   M
4   17     4   M

In [44]:
df.applymap(lambda x:x+2 if type(x) is int else x)

   age  Medu sex
0   19     6   F
1   17     5   F
2   16     4   M
3   20     7   M
4   19     6   M

In [47]:
df1 = pd.DataFrame({'a':['A','B','C'],'b':[1,2,3]})
df2 = pd.DataFrame({'a':['B','C','D'],'b':['T','F','T']})
pd.merge(df1,df2,how='left',on='a')

   a  b_x  b_y
0  A    1  NaN
1  B    2    T
2  C    3    F

In [48]:
df1 = pd.DataFrame({'a':['A','B','C'],'b':[1,2,3]})
df2 = pd.DataFrame({'a':['B','C','D'],'b':[2,3,4]})

In [51]:
pd.merge(df1,df2,how = 'outer')

   a  b
0  A  1
1  B  2
2  C  3
3  D  4

In [52]:
pd.merge(df1,df2,how = 'inner')

   a  b
0  B  2
1  C  3

In [58]:
df = pd.DataFrame({"a" : [5 ,2,],"b" :[4, 5,]})
df1 = pd.DataFrame({"a" : [4 ,2],"b" :[7, 5]})

In [59]:
pd.concat([df,df1],axis = 1)

   a  b  a  b
0  5  4  4  7
1  2  5  2  5

In [61]:
pd.concat([df,df1])

   a  b
0  5  4
1  2  5
0  4  7
1  2  5

In [56]:
df = pd.DataFrame({"a" : [5 ,2,],"b" :[4, 5]})
df1 = pd.DataFrame({"a" : [4 ,2],"b" :[7, 5]})

In [57]:
pd.concat([df,df1])

   a  b
0  5  4
1  2  5
0  4  7
1  2  5